espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_eco5_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Version Register */
/** Type of id0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_id : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dmac_id:32;
    };
    uint32_t val;
} dmac_id0_reg_t;

/** Type of compver0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_compver : RO; bitpos: [31:0]; default: 842018858;
         *  NA
         */
        uint32_t dmac_compver:32;
    };
    uint32_t val;
} dmac_compver0_reg_t;


/** Group: Configuration Registers */
/** Type of cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dmac_en:1;
        /** int_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t int_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dmac_cfg0_reg_t;

/** Type of chen0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_en:1;
        /** ch2_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_en:1;
        /** ch3_en : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_en:1;
        /** ch4_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_en:1;
        uint32_t reserved_4:4;
        /** ch1_en_we : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch1_en_we:1;
        /** ch2_en_we : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch2_en_we:1;
        /** ch3_en_we : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch3_en_we:1;
        /** ch4_en_we : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch4_en_we:1;
        uint32_t reserved_12:4;
        /** ch1_susp : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch1_susp:1;
        /** ch2_susp : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t ch2_susp:1;
        /** ch3_susp : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t ch3_susp:1;
        /** ch4_susp : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t ch4_susp:1;
        uint32_t reserved_20:4;
        /** ch1_susp_we : WO; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t ch1_susp_we:1;
        /** ch2_susp_we : WO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch2_susp_we:1;
        /** ch3_susp_we : WO; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t ch3_susp_we:1;
        /** ch4_susp_we : WO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch4_susp_we:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dmac_chen0_reg_t;

/** Type of chen1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_abort : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_abort:1;
        /** ch2_abort : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_abort:1;
        /** ch3_abort : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_abort:1;
        /** ch4_abort : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_abort:1;
        uint32_t reserved_4:4;
        /** ch1_abort_we : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch1_abort_we:1;
        /** ch2_abort_we : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch2_abort_we:1;
        /** ch3_abort_we : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch3_abort_we:1;
        /** ch4_abort_we : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch4_abort_we:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dmac_chen1_reg_t;

/** Type of reset0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_rst : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dmac_rst:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} dmac_reset0_reg_t;

/** Type of lowpower_cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** gbl_cslp_en : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t gbl_cslp_en:1;
        /** chnl_cslp_en : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t chnl_cslp_en:1;
        /** sbiu_cslp_en : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t sbiu_cslp_en:1;
        /** mxif_cslp_en : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t mxif_cslp_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_lowpower_cfg0_reg_t;

/** Type of lowpower_cfg1 register
 *  NA
 */
typedef union {
    struct {
        /** glch_lpdly : R/W; bitpos: [7:0]; default: 64;
         *  NA
         */
        uint32_t glch_lpdly:8;
        /** sbiu_lpdly : R/W; bitpos: [15:8]; default: 64;
         *  NA
         */
        uint32_t sbiu_lpdly:8;
        /** mxif_lpdly : R/W; bitpos: [23:16]; default: 64;
         *  NA
         */
        uint32_t mxif_lpdly:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dmac_lowpower_cfg1_reg_t;

/** Type of ch1_sar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_sar0:32;
    };
    uint32_t val;
} dmac_ch1_sar0_reg_t;

/** Type of ch1_sar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_sar1:32;
    };
    uint32_t val;
} dmac_ch1_sar1_reg_t;

