espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_eco5_struct.h
/** Type of commonreg_intclear0 register
 *  NA
 */
typedef union {
    struct {
        /** clear_slvif_commonreg_dec_err_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_dec_err_intstat:1;
        /** clear_slvif_commonreg_wr2ro_err_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wr2ro_err_intstat:1;
        /** clear_slvif_commonreg_rd2wo_err_intstat : WO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_rd2wo_err_intstat:1;
        /** clear_slvif_commonreg_wronhold_err_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wronhold_err_intstat:1;
        uint32_t reserved_4:3;
        /** clear_slvif_commonreg_wrparity_err_intstat : WO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wrparity_err_intstat:1;
        /** clear_slvif_undefinedreg_dec_err_intstat : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_undefinedreg_dec_err_intstat:1;
        /** clear_mxif1_rch0_eccprot_correrr_intstat : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch0_eccprot_correrr_intstat:1;
        /** clear_mxif1_rch0_eccprot_uncorrerr_intstat : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch0_eccprot_uncorrerr_intstat:1;
        /** clear_mxif1_rch1_eccprot_correrr_intstat : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch1_eccprot_correrr_intstat:1;
        /** clear_mxif1_rch1_eccprot_uncorrerr_intstat : WO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch1_eccprot_uncorrerr_intstat:1;
        /** clear_mxif1_bch_eccprot_correrr_intstat : WO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_bch_eccprot_correrr_intstat:1;
        /** clear_mxif1_bch_eccprot_uncorrerr_intstat : WO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_bch_eccprot_uncorrerr_intstat:1;
        /** clear_mxif2_rch0_eccprot_correrr_intstat : WO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch0_eccprot_correrr_intstat:1;
        /** clear_mxif2_rch0_eccprot_uncorrerr_intstat : WO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch0_eccprot_uncorrerr_intstat:1;
        /** clear_mxif2_rch1_eccprot_correrr_intstat : WO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch1_eccprot_correrr_intstat:1;
        /** clear_mxif2_rch1_eccprot_uncorrerr_intstat : WO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch1_eccprot_uncorrerr_intstat:1;
        /** clear_mxif2_bch_eccprot_correrr_intstat : WO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_bch_eccprot_correrr_intstat:1;
        /** clear_mxif2_bch_eccprot_uncorrerr_intstat : WO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_bch_eccprot_uncorrerr_intstat:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dmac_commonreg_intclear0_reg_t;

/** Type of commonreg_intstatus_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** enable_slvif_commonreg_dec_err_intstat : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_dec_err_intstat:1;
        /** enable_slvif_commonreg_wr2ro_err_intstat : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wr2ro_err_intstat:1;
        /** enable_slvif_commonreg_rd2wo_err_intstat : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_rd2wo_err_intstat:1;
        /** enable_slvif_commonreg_wronhold_err_intstat : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wronhold_err_intstat:1;
        uint32_t reserved_4:3;
        /** enable_slvif_commonreg_wrparity_err_intstat : RO; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wrparity_err_intstat:1;
        /** enable_slvif_undefinedreg_dec_err_intstat : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_undefinedreg_dec_err_intstat:1;
        /** enable_mxif1_rch0_eccprot_correrr_intstat : RO; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_correrr_intstat:1;
        /** enable_mxif1_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_uncorrerr_intstat:1;
        /** enable_mxif1_rch1_eccprot_correrr_intstat : RO; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_correrr_intstat:1;
        /** enable_mxif1_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_uncorrerr_intstat:1;
        /** enable_mxif1_bch_eccprot_correrr_intstat : RO; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_correrr_intstat:1;
        /** enable_mxif1_bch_eccprot_uncorrerr_intstat : RO; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_uncorrerr_intstat:1;
        /** enable_mxif2_rch0_eccprot_correrr_intstat : RO; bitpos: [15]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_correrr_intstat:1;
        /** enable_mxif2_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_uncorrerr_intstat:1;
        /** enable_mxif2_rch1_eccprot_correrr_intstat : RO; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_correrr_intstat:1;
        /** enable_mxif2_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_uncorrerr_intstat:1;
        /** enable_mxif2_bch_eccprot_correrr_intstat : RO; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_correrr_intstat:1;
        /** enable_mxif2_bch_eccprot_uncorrerr_intstat : RO; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_uncorrerr_intstat:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dmac_commonreg_intstatus_enable0_reg_t;

/** Type of commonreg_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** enable_slvif_commonreg_dec_err_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_dec_err_intsignal:1;
        /** enable_slvif_commonreg_wr2ro_err_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wr2ro_err_intsignal:1;
        /** enable_slvif_commonreg_rd2wo_err_intsignal : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_rd2wo_err_intsignal:1;
        /** enable_slvif_commonreg_wronhold_err_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wronhold_err_intsignal:1;
        uint32_t reserved_4:3;
        /** enable_slvif_commonreg_wrparity_err_intsignal : RO; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wrparity_err_intsignal:1;
        /** enable_slvif_undefinedreg_dec_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_undefinedreg_dec_err_intsignal:1;
        /** enable_mxif1_rch0_eccprot_correrr_intsignal : RO; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_correrr_intsignal:1;
        /** enable_mxif1_rch0_eccprot_uncorrerr_intsignal : RO; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_uncorrerr_intsignal:1;
        /** enable_mxif1_rch1_eccprot_correrr_intsignal : RO; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_correrr_intsignal:1;
        /** enable_mxif1_rch1_eccprot_uncorrerr_intsignal : RO; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_uncorrerr_intsignal:1;
        /** enable_mxif1_bch_eccprot_correrr_intsignal : RO; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_correrr_intsignal:1;
        /** enable_mxif1_bch_eccprot_uncorrerr_intsignal : RO; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_uncorrerr_intsignal:1;
        /** enable_mxif2_rch0_eccprot_correrr_intsignal : RO; bitpos: [15]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_correrr_intsignal:1;
        /** enable_mxif2_rch0_eccprot_uncorrerr_intsignal : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_uncorrerr_intsignal:1;
        /** enable_mxif2_rch1_eccprot_correrr_intsignal : RO; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_correrr_intsignal:1;
        /** enable_mxif2_rch1_eccprot_uncorrerr_intsignal : RO; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_uncorrerr_intsignal:1;
        /** enable_mxif2_bch_eccprot_correrr_intsignal : RO; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_correrr_intsignal:1;
        /** enable_mxif2_bch_eccprot_uncorrerr_intsignal : RO; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_uncorrerr_intsignal:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dmac_commonreg_intsignal_enable0_reg_t;

