espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_eco5_struct.h
/** Type of ch4_intstatus1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch4_ecc_prot_chmem_correrr_intstat:1;
        /** ch4_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch4_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch4_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch4_ecc_prot_uidmem_correrr_intstat:1;
        /** ch4_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch4_intstatus1_reg_t;

/** Type of ch4_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_enable_block_tfr_done_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_block_tfr_done_intsignal:1;
        /** ch4_enable_dma_tfr_done_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_dma_tfr_done_intsignal:1;
        uint32_t reserved_2:1;
        /** ch4_enable_src_transcomp_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_src_transcomp_intsignal:1;
        /** ch4_enable_dst_transcomp_intsignal : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_dst_transcomp_intsignal:1;
        /** ch4_enable_src_dec_err_intsignal : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_src_dec_err_intsignal:1;
        /** ch4_enable_dst_dec_err_intsignal : R/W; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_dst_dec_err_intsignal:1;
        /** ch4_enable_src_slv_err_intsignal : R/W; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_src_slv_err_intsignal:1;
        /** ch4_enable_dst_slv_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_dst_slv_err_intsignal:1;
        /** ch4_enable_lli_rd_dec_err_intsignal : R/W; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_lli_rd_dec_err_intsignal:1;
        /** ch4_enable_lli_wr_dec_err_intsignal : R/W; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_lli_wr_dec_err_intsignal:1;
        /** ch4_enable_lli_rd_slv_err_intsignal : R/W; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_lli_rd_slv_err_intsignal:1;
        /** ch4_enable_lli_wr_slv_err_intsignal : R/W; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_lli_wr_slv_err_intsignal:1;
        /** ch4_enable_shadowreg_or_lli_invalid_err_intsignal : R/W; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_shadowreg_or_lli_invalid_err_intsignal:1;
        /** ch4_enable_slvif_multiblktype_err_intsignal : R/W; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_multiblktype_err_intsignal:1;
        uint32_t reserved_15:1;
        /** ch4_enable_slvif_dec_err_intsignal : R/W; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_dec_err_intsignal:1;
        /** ch4_enable_slvif_wr2ro_err_intsignal : R/W; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_wr2ro_err_intsignal:1;
        /** ch4_enable_slvif_rd2rwo_err_intsignal : R/W; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_rd2rwo_err_intsignal:1;
        /** ch4_enable_slvif_wronchen_err_intsignal : R/W; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_wronchen_err_intsignal:1;
        /** ch4_enable_slvif_shadowreg_wron_valid_err_intsignal : R/W; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_shadowreg_wron_valid_err_intsignal:1;
        /** ch4_enable_slvif_wronhold_err_intsignal : R/W; bitpos: [21]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_wronhold_err_intsignal:1;
        uint32_t reserved_22:3;
        /** ch4_enable_slvif_wrparity_err_intsignal : RO; bitpos: [25]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_slvif_wrparity_err_intsignal:1;
        uint32_t reserved_26:1;
        /** ch4_enable_ch_lock_cleared_intsignal : R/W; bitpos: [27]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ch_lock_cleared_intsignal:1;
        /** ch4_enable_ch_src_suspended_intsignal : R/W; bitpos: [28]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ch_src_suspended_intsignal:1;
        /** ch4_enable_ch_suspended_intsignal : R/W; bitpos: [29]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ch_suspended_intsignal:1;
        /** ch4_enable_ch_disabled_intsignal : R/W; bitpos: [30]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ch_disabled_intsignal:1;
        /** ch4_enable_ch_aborted_intsignal : R/W; bitpos: [31]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ch_aborted_intsignal:1;
    };
    uint32_t val;
} dmac_ch4_intsignal_enable0_reg_t;

/** Type of ch4_intsignal_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_enable_ecc_prot_chmem_correrr_intsignal : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ecc_prot_chmem_correrr_intsignal:1;
        /** ch4_enable_ecc_prot_chmem_uncorrerr_intsignal : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ecc_prot_chmem_uncorrerr_intsignal:1;
        /** ch4_enable_ecc_prot_uidmem_correrr_intsignal : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ecc_prot_uidmem_correrr_intsignal:1;
        /** ch4_enable_ecc_prot_uidmem_uncorrerr_intsignal : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t ch4_enable_ecc_prot_uidmem_uncorrerr_intsignal:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch4_intsignal_enable1_reg_t;

/** Type of ch4_intclear0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_clear_block_tfr_done_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_block_tfr_done_intstat:1;
        /** ch4_clear_dma_tfr_done_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_dma_tfr_done_intstat:1;
        uint32_t reserved_2:1;
        /** ch4_clear_src_transcomp_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_src_transcomp_intstat:1;
        /** ch4_clear_dst_transcomp_intstat : WO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_dst_transcomp_intstat:1;
        /** ch4_clear_src_dec_err_intstat : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_src_dec_err_intstat:1;
        /** ch4_clear_dst_dec_err_intstat : WO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_dst_dec_err_intstat:1;
        /** ch4_clear_src_slv_err_intstat : WO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_src_slv_err_intstat:1;
        /** ch4_clear_dst_slv_err_intstat : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_dst_slv_err_intstat:1;
        /** ch4_clear_lli_rd_dec_err_intstat : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_lli_rd_dec_err_intstat:1;
        /** ch4_clear_lli_wr_dec_err_intstat : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_lli_wr_dec_err_intstat:1;
        /** ch4_clear_lli_rd_slv_err_intstat : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_lli_rd_slv_err_intstat:1;
        /** ch4_clear_lli_wr_slv_err_intstat : WO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_lli_wr_slv_err_intstat:1;
        /** ch4_clear_shadowreg_or_lli_invalid_err_intstat : WO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_shadowreg_or_lli_invalid_err_intstat:1;
        /** ch4_clear_slvif_multiblktype_err_intstat : WO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_multiblktype_err_intstat:1;
        uint32_t reserved_15:1;
        /** ch4_clear_slvif_dec_err_intstat : WO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_dec_err_intstat:1;
        /** ch4_clear_slvif_wr2ro_err_intstat : WO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_wr2ro_err_intstat:1;
        /** ch4_clear_slvif_rd2rwo_err_intstat : WO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_rd2rwo_err_intstat:1;
        /** ch4_clear_slvif_wronchen_err_intstat : WO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_wronchen_err_intstat:1;
        /** ch4_clear_slvif_shadowreg_wron_valid_err_intstat : WO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_shadowreg_wron_valid_err_intstat:1;
        /** ch4_clear_slvif_wronhold_err_intstat : WO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_wronhold_err_intstat:1;
        uint32_t reserved_22:3;
        /** ch4_clear_slvif_wrparity_err_intstat : WO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_slvif_wrparity_err_intstat:1;
        uint32_t reserved_26:1;
        /** ch4_clear_ch_lock_cleared_intstat : WO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ch_lock_cleared_intstat:1;
        /** ch4_clear_ch_src_suspended_intstat : WO; bitpos: [28]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ch_src_suspended_intstat:1;
        /** ch4_clear_ch_suspended_intstat : WO; bitpos: [29]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ch_suspended_intstat:1;
        /** ch4_clear_ch_disabled_intstat : WO; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ch_disabled_intstat:1;
        /** ch4_clear_ch_aborted_intstat : WO; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ch_aborted_intstat:1;
    };
    uint32_t val;
} dmac_ch4_intclear0_reg_t;

/** Type of ch4_intclear1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_clear_ecc_prot_chmem_correrr_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ecc_prot_chmem_correrr_intstat:1;
        /** ch4_clear_ecc_prot_chmem_uncorrerr_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ecc_prot_chmem_uncorrerr_intstat:1;
        /** ch4_clear_ecc_prot_uidmem_correrr_intstat : WO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ecc_prot_uidmem_correrr_intstat:1;
        /** ch4_clear_ecc_prot_uidmem_uncorrerr_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_clear_ecc_prot_uidmem_uncorrerr_intstat:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dmac_ch4_intclear1_reg_t;


/** Group: Status Registers */
/** Type of ch1_status0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_cmpltd_blk_tfr_size : RO; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch1_cmpltd_blk_tfr_size:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch1_status0_reg_t;

/** Type of ch1_status1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_data_left_in_fifo : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t ch1_data_left_in_fifo:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dmac_ch1_status1_reg_t;

