espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_eco5_struct.h
/** Type of ch1_sstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_sstat:32;
    };
    uint32_t val;
} dmac_ch1_sstat0_reg_t;

/** Type of ch1_dstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_dstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_dstat:32;
    };
    uint32_t val;
} dmac_ch1_dstat0_reg_t;

/** Type of ch1_sstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_sstatar0:32;
    };
    uint32_t val;
} dmac_ch1_sstatar0_reg_t;

/** Type of ch1_sstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_sstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_sstatar1:32;
    };
    uint32_t val;
} dmac_ch1_sstatar1_reg_t;

/** Type of ch1_dstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_dstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_dstatar0:32;
    };
    uint32_t val;
} dmac_ch1_dstatar0_reg_t;

/** Type of ch1_dstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_dstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch1_dstatar1:32;
    };
    uint32_t val;
} dmac_ch1_dstatar1_reg_t;

/** Type of ch2_status0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_cmpltd_blk_tfr_size : RO; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch2_cmpltd_blk_tfr_size:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch2_status0_reg_t;

/** Type of ch2_status1 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_data_left_in_fifo : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t ch2_data_left_in_fifo:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dmac_ch2_status1_reg_t;

/** Type of ch2_sstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_sstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_sstat:32;
    };
    uint32_t val;
} dmac_ch2_sstat0_reg_t;

/** Type of ch2_dstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_dstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_dstat:32;
    };
    uint32_t val;
} dmac_ch2_dstat0_reg_t;

/** Type of ch2_sstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_sstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_sstatar0:32;
    };
    uint32_t val;
} dmac_ch2_sstatar0_reg_t;

/** Type of ch2_sstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_sstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_sstatar1:32;
    };
    uint32_t val;
} dmac_ch2_sstatar1_reg_t;

/** Type of ch2_dstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_dstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_dstatar0:32;
    };
    uint32_t val;
} dmac_ch2_dstatar0_reg_t;

/** Type of ch2_dstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch2_dstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch2_dstatar1:32;
    };
    uint32_t val;
} dmac_ch2_dstatar1_reg_t;

/** Type of ch3_status0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_cmpltd_blk_tfr_size : RO; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch3_cmpltd_blk_tfr_size:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch3_status0_reg_t;

/** Type of ch3_status1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_data_left_in_fifo : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t ch3_data_left_in_fifo:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dmac_ch3_status1_reg_t;

/** Type of ch3_sstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_sstat:32;
    };
    uint32_t val;
} dmac_ch3_sstat0_reg_t;

/** Type of ch3_dstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_dstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_dstat:32;
    };
    uint32_t val;
} dmac_ch3_dstat0_reg_t;

/** Type of ch3_sstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_sstatar0:32;
    };
    uint32_t val;
} dmac_ch3_sstatar0_reg_t;

/** Type of ch3_sstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_sstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_sstatar1:32;
    };
    uint32_t val;
} dmac_ch3_sstatar1_reg_t;

/** Type of ch3_dstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_dstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_dstatar0:32;
    };
    uint32_t val;
} dmac_ch3_dstatar0_reg_t;

/** Type of ch3_dstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch3_dstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch3_dstatar1:32;
    };
    uint32_t val;
} dmac_ch3_dstatar1_reg_t;

/** Type of ch4_status0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_cmpltd_blk_tfr_size : RO; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t ch4_cmpltd_blk_tfr_size:22;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} dmac_ch4_status0_reg_t;

/** Type of ch4_status1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_data_left_in_fifo : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t ch4_data_left_in_fifo:15;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} dmac_ch4_status1_reg_t;

