espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_eco5_struct.h
/** Type of ch4_sstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_sstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_sstat:32;
    };
    uint32_t val;
} dmac_ch4_sstat0_reg_t;

/** Type of ch4_dstat0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_dstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_dstat:32;
    };
    uint32_t val;
} dmac_ch4_dstat0_reg_t;

/** Type of ch4_sstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_sstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_sstatar0:32;
    };
    uint32_t val;
} dmac_ch4_sstatar0_reg_t;

/** Type of ch4_sstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_sstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_sstatar1:32;
    };
    uint32_t val;
} dmac_ch4_sstatar1_reg_t;

/** Type of ch4_dstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_dstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_dstatar0:32;
    };
    uint32_t val;
} dmac_ch4_dstatar0_reg_t;

/** Type of ch4_dstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** ch4_dstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t ch4_dstatar1:32;
    };
    uint32_t val;
} dmac_ch4_dstatar1_reg_t;


typedef struct {
    volatile dmac_id0_reg_t id0;
    uint32_t reserved_004;
    volatile dmac_compver0_reg_t compver0;
    uint32_t reserved_00c;
    volatile dmac_cfg0_reg_t cfg0;
    uint32_t reserved_014;
    volatile dmac_chen0_reg_t chen0;
    volatile dmac_chen1_reg_t chen1;
    uint32_t reserved_020[4];
    volatile dmac_intstatus0_reg_t intstatus0;
    uint32_t reserved_034;
    volatile dmac_commonreg_intclear0_reg_t commonreg_intclear0;
    uint32_t reserved_03c;
    volatile dmac_commonreg_intstatus_enable0_reg_t commonreg_intstatus_enable0;
    uint32_t reserved_044;
    volatile dmac_commonreg_intsignal_enable0_reg_t commonreg_intsignal_enable0;
    uint32_t reserved_04c;
    volatile dmac_commonreg_intstatus0_reg_t commonreg_intstatus0;
    uint32_t reserved_054;
    volatile dmac_reset0_reg_t reset0;
    uint32_t reserved_05c;
    volatile dmac_lowpower_cfg0_reg_t lowpower_cfg0;
    volatile dmac_lowpower_cfg1_reg_t lowpower_cfg1;
    uint32_t reserved_068[38];
    volatile dmac_ch1_sar0_reg_t ch1_sar0;
    volatile dmac_ch1_sar1_reg_t ch1_sar1;
    volatile dmac_ch1_dar0_reg_t ch1_dar0;
    volatile dmac_ch1_dar1_reg_t ch1_dar1;
    volatile dmac_ch1_block_ts0_reg_t ch1_block_ts0;
    uint32_t reserved_114;
    volatile dmac_ch1_ctl0_reg_t ch1_ctl0;
    volatile dmac_ch1_ctl1_reg_t ch1_ctl1;
    volatile dmac_ch1_cfg0_reg_t ch1_cfg0;
    volatile dmac_ch1_cfg1_reg_t ch1_cfg1;
    volatile dmac_ch1_llp0_reg_t ch1_llp0;
    volatile dmac_ch1_llp1_reg_t ch1_llp1;
    volatile dmac_ch1_status0_reg_t ch1_status0;
    volatile dmac_ch1_status1_reg_t ch1_status1;
    volatile dmac_ch1_swhssrc0_reg_t ch1_swhssrc0;
    uint32_t reserved_13c;
    volatile dmac_ch1_swhsdst0_reg_t ch1_swhsdst0;
    uint32_t reserved_144;
    volatile dmac_ch1_blk_tfr_resumereq0_reg_t ch1_blk_tfr_resumereq0;
    uint32_t reserved_14c;
    volatile dmac_ch1_axi_id0_reg_t ch1_axi_id0;
    uint32_t reserved_154;
    volatile dmac_ch1_axi_qos0_reg_t ch1_axi_qos0;
    uint32_t reserved_15c;
    volatile dmac_ch1_sstat0_reg_t ch1_sstat0;
    uint32_t reserved_164;
    volatile dmac_ch1_dstat0_reg_t ch1_dstat0;
    uint32_t reserved_16c;
    volatile dmac_ch1_sstatar0_reg_t ch1_sstatar0;
    volatile dmac_ch1_sstatar1_reg_t ch1_sstatar1;
    volatile dmac_ch1_dstatar0_reg_t ch1_dstatar0;
    volatile dmac_ch1_dstatar1_reg_t ch1_dstatar1;
    volatile dmac_ch1_intstatus_enable0_reg_t ch1_intstatus_enable0;
    volatile dmac_ch1_intstatus_enable1_reg_t ch1_intstatus_enable1;
    volatile dmac_ch1_intstatus0_reg_t ch1_intstatus0;
    volatile dmac_ch1_intstatus1_reg_t ch1_intstatus1;
    volatile dmac_ch1_intsignal_enable0_reg_t ch1_intsignal_enable0;
    volatile dmac_ch1_intsignal_enable1_reg_t ch1_intsignal_enable1;
    volatile dmac_ch1_intclear0_reg_t ch1_intclear0;
    volatile dmac_ch1_intclear1_reg_t ch1_intclear1;
    uint32_t reserved_1a0[24];
    volatile dmac_ch2_sar0_reg_t ch2_sar0;
    volatile dmac_ch2_sar1_reg_t ch2_sar1;
    volatile dmac_ch2_dar0_reg_t ch2_dar0;
    volatile dmac_ch2_dar1_reg_t ch2_dar1;
    volatile dmac_ch2_block_ts0_reg_t ch2_block_ts0;
    uint32_t reserved_214;
    volatile dmac_ch2_ctl0_reg_t ch2_ctl0;
    volatile dmac_ch2_ctl1_reg_t ch2_ctl1;
    volatile dmac_ch2_cfg0_reg_t ch2_cfg0;
    volatile dmac_ch2_cfg1_reg_t ch2_cfg1;
    volatile dmac_ch2_llp0_reg_t ch2_llp0;
    volatile dmac_ch2_llp1_reg_t ch2_llp1;
    volatile dmac_ch2_status0_reg_t ch2_status0;
    volatile dmac_ch2_status1_reg_t ch2_status1;
    volatile dmac_ch2_swhssrc0_reg_t ch2_swhssrc0;
    uint32_t reserved_23c;
    volatile dmac_ch2_swhsdst0_reg_t ch2_swhsdst0;
    uint32_t reserved_244;
    volatile dmac_ch2_blk_tfr_resumereq0_reg_t ch2_blk_tfr_resumereq0;
    uint32_t reserved_24c;
    volatile dmac_ch2_axi_id0_reg_t ch2_axi_id0;
    uint32_t reserved_254;
    volatile dmac_ch2_axi_qos0_reg_t ch2_axi_qos0;
    uint32_t reserved_25c;
    volatile dmac_ch2_sstat0_reg_t ch2_sstat0;
    uint32_t reserved_264;
    volatile dmac_ch2_dstat0_reg_t ch2_dstat0;
    uint32_t reserved_26c;
    volatile dmac_ch2_sstatar0_reg_t ch2_sstatar0;
    volatile dmac_ch2_sstatar1_reg_t ch2_sstatar1;
    volatile dmac_ch2_dstatar0_reg_t ch2_dstatar0;
    volatile dmac_ch2_dstatar1_reg_t ch2_dstatar1;
    volatile dmac_ch2_intstatus_enable0_reg_t ch2_intstatus_enable0;
    volatile dmac_ch2_intstatus_enable1_reg_t ch2_intstatus_enable1;
    volatile dmac_ch2_intstatus0_reg_t ch2_intstatus0;
    volatile dmac_ch2_intstatus1_reg_t ch2_intstatus1;
    volatile dmac_ch2_intsignal_enable0_reg_t ch2_intsignal_enable0;
    volatile dmac_ch2_intsignal_enable1_reg_t ch2_intsignal_enable1;
    volatile dmac_ch2_intclear0_reg_t ch2_intclear0;
    volatile dmac_ch2_intclear1_reg_t ch2_intclear1;
    uint32_t reserved_2a0[24];
    volatile dmac_ch3_sar0_reg_t ch3_sar0;
    volatile dmac_ch3_sar1_reg_t ch3_sar1;
    volatile dmac_ch3_dar0_reg_t ch3_dar0;
    volatile dmac_ch3_dar1_reg_t ch3_dar1;
    volatile dmac_ch3_block_ts0_reg_t ch3_block_ts0;
    uint32_t reserved_314;
    volatile dmac_ch3_ctl0_reg_t ch3_ctl0;
    volatile dmac_ch3_ctl1_reg_t ch3_ctl1;
    volatile dmac_ch3_cfg0_reg_t ch3_cfg0;
    volatile dmac_ch3_cfg1_reg_t ch3_cfg1;
    volatile dmac_ch3_llp0_reg_t ch3_llp0;
    volatile dmac_ch3_llp1_reg_t ch3_llp1;
    volatile dmac_ch3_status0_reg_t ch3_status0;
    volatile dmac_ch3_status1_reg_t ch3_status1;
    volatile dmac_ch3_swhssrc0_reg_t ch3_swhssrc0;
    uint32_t reserved_33c;
    volatile dmac_ch3_swhsdst0_reg_t ch3_swhsdst0;
    uint32_t reserved_344;
    volatile dmac_ch3_blk_tfr_resumereq0_reg_t ch3_blk_tfr_resumereq0;
    uint32_t reserved_34c;
    volatile dmac_ch3_axi_id0_reg_t ch3_axi_id0;
    uint32_t reserved_354;
    volatile dmac_ch3_axi_qos0_reg_t ch3_axi_qos0;
    uint32_t reserved_35c;
    volatile dmac_ch3_sstat0_reg_t ch3_sstat0;
    uint32_t reserved_364;
    volatile dmac_ch3_dstat0_reg_t ch3_dstat0;
    uint32_t reserved_36c;
    volatile dmac_ch3_sstatar0_reg_t ch3_sstatar0;
    volatile dmac_ch3_sstatar1_reg_t ch3_sstatar1;
    volatile dmac_ch3_dstatar0_reg_t ch3_dstatar0;
    volatile dmac_ch3_dstatar1_reg_t ch3_dstatar1;
    volatile dmac_ch3_intstatus_enable0_reg_t ch3_intstatus_enable0;
    volatile dmac_ch3_intstatus_enable1_reg_t ch3_intstatus_enable1;
    volatile dmac_ch3_intstatus0_reg_t ch3_intstatus0;
    volatile dmac_ch3_intstatus1_reg_t ch3_intstatus1;
    volatile dmac_ch3_intsignal_enable0_reg_t ch3_intsignal_enable0;
    volatile dmac_ch3_intsignal_enable1_reg_t ch3_intsignal_enable1;
    volatile dmac_ch3_intclear0_reg_t ch3_intclear0;
    volatile dmac_ch3_intclear1_reg_t ch3_intclear1;
    uint32_t reserved_3a0[24];
    volatile dmac_ch4_sar0_reg_t ch4_sar0;
    volatile dmac_ch4_sar1_reg_t ch4_sar1;
    volatile dmac_ch4_dar0_reg_t ch4_dar0;
    volatile dmac_ch4_dar1_reg_t ch4_dar1;
    volatile dmac_ch4_block_ts0_reg_t ch4_block_ts0;
    uint32_t reserved_414;
    volatile dmac_ch4_ctl0_reg_t ch4_ctl0;
    volatile dmac_ch4_ctl1_reg_t ch4_ctl1;
    volatile dmac_ch4_cfg0_reg_t ch4_cfg0;
    volatile dmac_ch4_cfg1_reg_t ch4_cfg1;
    volatile dmac_ch4_llp0_reg_t ch4_llp0;
    volatile dmac_ch4_llp1_reg_t ch4_llp1;
    volatile dmac_ch4_status0_reg_t ch4_status0;
    volatile dmac_ch4_status1_reg_t ch4_status1;
    volatile dmac_ch4_swhssrc0_reg_t ch4_swhssrc0;
    uint32_t reserved_43c;
    volatile dmac_ch4_swhsdst0_reg_t ch4_swhsdst0;
    uint32_t reserved_444;
    volatile dmac_ch4_blk_tfr_resumereq0_reg_t ch4_blk_tfr_resumereq0;
    uint32_t reserved_44c;
    volatile dmac_ch4_axi_id0_reg_t ch4_axi_id0;
    uint32_t reserved_454;
    volatile dmac_ch4_axi_qos0_reg_t ch4_axi_qos0;
    uint32_t reserved_45c;
    volatile dmac_ch4_sstat0_reg_t ch4_sstat0;
    uint32_t reserved_464;
    volatile dmac_ch4_dstat0_reg_t ch4_dstat0;
    uint32_t reserved_46c;
    volatile dmac_ch4_sstatar0_reg_t ch4_sstatar0;
    volatile dmac_ch4_sstatar1_reg_t ch4_sstatar1;
    volatile dmac_ch4_dstatar0_reg_t ch4_dstatar0;
    volatile dmac_ch4_dstatar1_reg_t ch4_dstatar1;
    volatile dmac_ch4_intstatus_enable0_reg_t ch4_intstatus_enable0;
    volatile dmac_ch4_intstatus_enable1_reg_t ch4_intstatus_enable1;
    volatile dmac_ch4_intstatus0_reg_t ch4_intstatus0;
    volatile dmac_ch4_intstatus1_reg_t ch4_intstatus1;
    volatile dmac_ch4_intsignal_enable0_reg_t ch4_intsignal_enable0;
    volatile dmac_ch4_intsignal_enable1_reg_t ch4_intsignal_enable1;
    volatile dmac_ch4_intclear0_reg_t ch4_intclear0;
    volatile dmac_ch4_intclear1_reg_t ch4_intclear1;
} dmac_dev_t;

extern dmac_dev_t GDMA;

#ifndef __cplusplus
_Static_assert(sizeof(dmac_dev_t) == 0x4a0, "Invalid size of dmac_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
